-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 13, 2022 at 05:36 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `myproject`
--

-- --------------------------------------------------------

--
-- Table structure for table `herb_tbl`
--

CREATE TABLE `herb_tbl` (
  `Herb_id` int(11) NOT NULL,
  `Herb_Name` varchar(255) NOT NULL,
  `Details1` text NOT NULL,
  `Scientific_Name` varchar(255) NOT NULL,
  `Common_Name` varchar(255) NOT NULL,
  `Family` varchar(255) NOT NULL,
  `Details2` text NOT NULL,
  `Pic1` varchar(255) NOT NULL,
  `Pic2` varchar(255) NOT NULL,
  `Pic3` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `herb_tbl`
--

INSERT INTO `herb_tbl` (`Herb_id`, `Herb_Name`, `Details1`, `Scientific_Name`, `Common_Name`, `Family`, `Details2`, `Pic1`, `Pic2`, `Pic3`) VALUES
(1, 'ลูกใต้ใบ', 'ใช้แก้ไข้ เป็นสรรพคุณแรก ๆ ของลูกใต้ใบที่คนรู้จักกันมากที่สุดว่า สามารถแก้ไข้ได้ผลดีเยี่ยม ลูกใต้ใบ จึงมักเป็นสมุนไพรที่พระธุดงค์ มักพกติดตัวในยามออกธุดงค์ เพื่อแก้ไข้หวัด ไข้หวัดใหญ่ ที่อาจเกิดขึ้นได้จากอากาศที่เปลี่ยนแปลง นอกจากนี้ ลูกใต้ใบ ยังสามารถแก้ไข้จากการอ่อนเพลีย ไข้จับสั่น ได้อีก โดยวิธีการใช้จะนำลูกใต้ใบไปตากแห้งเก็บใส่โหลไว้ เพื่อชงเป็นชาดื่มเวลาเกิดอาการ', 'phyllanthus amarus Schum & Thonn.', 'Egg Woman', 'Euphorbiaceae', 'ชื่ออื่น : มะขามป้อมดิน หญ้าใต้ใบ หญ้าใต้ใบขาว ลักษณะทางพฤกษศาสตร์ : ไม้ล้มลุก สูง 10 - 60 เซนติเมตร ทุกส่วนมีรสขม ใบเป็นใบประกอบแบบขนนกชั้นเดียวปลายคี่ มีใบย่อย 23 - 25 ใบ ใบย่อยรูปขอบขนานแกมไข่กลับ ปลายใบมนกว้างโคนใบมนแคบ ขนาดประมาณ 0.40 X 1.00 เซนติเมตร ก้านใบสั้นมากและมีหูใบสีขาวนวลรูปสามเหลี่ยมปลายแหลมเกาะติด 2 อัน ดอกแยกเพศ เพศเมียมักอยู่ส่วนโคน เพศผู้มักอยู่ส่วนปลายก้านใบ ดอกขนาดเล็กสีขาว เส้นผ่าศูนย์กลางประมาณ 0.08 เซนติเมตร ผลทรงกลมผิวเรียบสีเขียวอ่อนนวล ขนาดประมาณ 0.15 เซนติเมตร เกาะติดอยู่ที่ใต้โคนใบย่อย เมื่อแก่จะแตกเป็น 6 พู แต่ละพูจะมี 1 เมล็ด เมล็ดสีน้ำตาลรูปเสี้ยว 1/6 ของทรงกลม ขนาดประมาณ 0.10 เซนติเมตร ส่วนที่ใช้ : ทั้งต้นสด สรรพคุณ : เป็นยาแก้ไข้ ลดความร้อน ขับปัสสาวะ วิธีและปริมาณที่ใช้ : นำต้นสด 1 กำมือ ต้มกับน้ำ 2 ถ้วยแก้ว เคี่ยวให้เหลือ 1 ½ ถ้วยแก้ว รับประทานครั้งละครึ่งถ้วยแก้ว สารเคมี : Potassium, phyllanthin, hypophyllanthin', 'upload/h-01.png', 'upload/h-01-01.jpg', 'upload/h-01-02.jpg'),
(2, 'พลูคาว', ' พลูคาวเป็นพืชที่มีอายุยืนและเป็นพืชสมุนไพรประจำถิ่นที่พบมากในแถบภาคเหนือของไทย และยังพบในบริเวณเทือกเขาหิมาลัย อินเดีย(india) เรื่อยมาจนถึงจีน(china) ลาว(laos) เกาหลี(korae) เวียดนาม(vietnam) และญี่ปุ่น(japan) ซึ่งถือเป็นพืชตระกูลเดียวกับพลู ชอบขึ้นในพื้นที่ชื้นแฉะ มีร่มเงาเล็กน้อยและสภาพอากาศเย็น โดยจะมีลักษณะแตกต่างจากพลู คือ ที่ใต้ใบของพลูคาวจะมีสีแดงอ่อนไปจนถึงสีแดงเข้ม', 'Houttuynia cordata Thunb.', 'Plu Kaow', 'Saururaceae', 'พลูคาวเป็นพืชที่มีอายุยืนและเป็นพืชสมุนไพรประจำถิ่นที่พบมากในแถบภาคเหนือของไทย และยังพบในบริเวณเทือกเขาหิมาลัย อินเดีย(india) เรื่อยมาจนถึงจีน(china) ลาว(laos) เกาหลี(korae) เวียดนาม(vietnam) และญี่ปุ่น(japan) ซึ่งถือเป็นพืชตระกูลเดียวกับพลู ชอบขึ้นในพื้นที่ชื้นแฉะ มีร่มเงาเล็กน้อยและสภาพอากาศเย็น โดยจะมีลักษณะแตกต่างจากพลู คือ ที่ใต้ใบของพลูคาวจะมีสีแดงอ่อนไปจนถึงสีแดงเข้ม', 'upload/h-02.jpg', 'upload/h-02-01.jpg', 'upload/h-02-02.jpg'),
(3, 'ชะพลู', ' มักมีการจำสับสนกับพลูทั้งที่เป็นคนละชนิดกัน ซึ่งใบจะรสไม่จัดเท่ากับพลูและยังมีขนาดเล็กกว่า สำหรับสรรพคุณของชะพลูที่สำคัญนั้นก็ได้แก่ ช่วยบำรุงธาตุ ขับลม แก้อาการท้องอืดท้องเฟ้อ และช่วยในการขับเสมหะ เป็นต้น และประโยชน์ของชะพลูในด้านของสุขภาพนั้นก็คือ มีวิตามินเอและธาตุแคลเซียมในปริมาณสูงเป็นพิเศษ และยังมีธาตุเหล็ก ธาตุฟอสฟอรัส คลอโรฟิลล์ เส้นใยอีกด้วย ซึ่งล้วนแล้วแต่มีประโยชน์ต่อร่างกายแทบทั้งสิ้น', 'Piper sarmentosum Roxb.', 'Wildbetal leafbush', 'PIPERACEAE', 'สมุนไพรชะพลู มีชื่อเรียกตามท้องถิ่นอื่น ๆ ว่า ผักพลูนก พลูลิง ปูลิง ปูลิงนก ผักปูนา (ภาคเหนือ), ผักแค ผักอีเลิด ผักนางเลิด (ภาคอีสาน), ช้าพลู (ภาคกลาง), นมวา (ภาคใต้) เป็นต้น\r\n\r\nชะพลู มักมีการจำสับสนกับพลูทั้งที่เป็นคนละชนิดกัน ซึ่งใบจะรสไม่จัดเท่ากับพลูและยังมีขนาดเล็กกว่า สำหรับสรรพคุณของชะพลูที่สำคัญนั้นก็ได้แก่ ช่วยบำรุงธาตุ ขับลม แก้อาการท้องอืดท้องเฟ้อ และช่วยในการขับเสมหะ เป็นต้น และประโยชน์ของชะพลูในด้านของสุขภาพนั้นก็คือ มีวิตามินเอและธาตุแคลเซียมในปริมาณสูงเป็นพิเศษ และยังมีธาตุเหล็ก ธาตุฟอสฟอรัส คลอโรฟิลล์ เส้นใยอีกด้วย ซึ่งล้วนแล้วแต่มีประโยชน์ต่อร่างกายแทบทั้งสิ้น\r\n\r\nใบชะพลู หากรับประทานในปริมาณมากหรือติดต่อกันเป็นเวลานาน แคลเซียมที่มีอยู่ในใบชะพลูจะเปลี่ยนเป็นแคลเซียมออกซาเลต (Oxalate) ซึ่งสารชนิดนี้เป็นสาเหตุที่ทำให้เกิดโรคนิ่วในไตได้ ดังนั้นคุณจึงควรดื่มน้ำตามมาก ๆ เพื่อให้สารออกซาเลตเจือจางลง และถูกขับออกทางปัสสาวะ หรือจะเลือกรับประทานอาหารที่มีโปรตีนสูง ๆ เพื่อป้องกันโรคนิ่วก็ทำได้เหมือนกัน เพื่อให้ร่างกายได้รับประโยชน์อย่างสูงสุดคุณควรรับประทานในปริมาณที่เหมาะสม', 'upload/h-03.jpg', 'upload/h-03-01.jpg', 'upload/h-03-02.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `herb_tbl`
--
ALTER TABLE `herb_tbl`
  ADD PRIMARY KEY (`Herb_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `herb_tbl`
--
ALTER TABLE `herb_tbl`
  MODIFY `Herb_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
